Ebiroll/qemu-stm32/hw/arm/stm32/stm32u535_rcc.c
/*
 * STM32 Microcontroller RCC (Reset and Clock Control) module
 *
 * Copyright (C) 2023 Olof Astrand
 *
 * Source code based on omap_clk.c
 * Implementation based on ST Microelectronics "RM0008 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "cpu.h"

#include "qemu/timer.h"
#include <stdio.h>

#include "hw/sysbus.h"
#include "hw/hw.h"
#include "hw/irq.h"
#include "stm32fxxx_clktree.h"
#include "stm32u535_rcc.h"
#include "qemu/log.h"
//#include "hw/arm/armv7m.h"
#include "migration/vmstate.h"
#include "hw/qdev-properties.h"


extern int system_clock_scale;

/* DEFINITIONS*/

/* See README for DEBUG details. */
#define DEBUG_STM32_RCC

#ifdef DEBUG_STM32_RCC
#define DPRINTF(fmt, ...)                                       \
do { printf("STM32U535_RCC: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif

#define IS_RESET_VALUE(new_value, mask, reset_value) ((new_value & mask) == (mask & reset_value))

#define WARN_UNIMPLEMENTED(new_value, mask, reset_value) \
    if (!IS_RESET_VALUE(new_value, mask, reset_value)) { \
        qemu_log_mask(LOG_UNIMP, "Not implemented: RCC " #mask ". Masked value: 0x%08x\n", (new_value & mask)); \
    }

#define WARN_UNIMPLEMENTED_REG(offset) \
        qemu_log_mask(LOG_UNIMP, "STM32u535_rcc: unimplemented register: 0x%x", (int)offset)

#define HSI_FREQ 16000000
#define LSI_FREQ 32000
/*
#define RCC_FLAG_HSIRDY                  ((uint8_t)0x21)
#define RCC_FLAG_HSERDY                  ((uint8_t)0x31)
#define RCC_FLAG_PLLRDY                  ((uint8_t)0x39)
#define RCC_FLAG_PLLI2SRDY               ((uint8_t)0x3B)
*/
// SAI & SAI1 and SAI2, 
#if 0
#define RCC_CR_MSISON_Pos                   (0U)
#define RCC_CR_MSIKERON_Pos                 (1U)
#define RCC_CR_MSISRDY_Pos                  (2U)
#define RCC_CR_MSIPLLEN_Pos                 (3U)
#define RCC_CR_MSIKON_Pos                   (4U)


#define RCC_CR_MSIKRDY_Pos                  (5U)
#define RCC_CR_MSIPLLSEL_Pos                (6U)
#define RCC_CR_MSIPLLFAST_Pos               (7U)
#define RCC_CR_HSION_Pos                    (8U)
#define RCC_CR_HSIKERON_Pos                 (9U)
#define RCC_CR_HSIRDY_Pos                   (10U)
#define RCC_CR_HSI48ON_Pos                  (12U)
#define RCC_CR_HSI48RDY_Pos                 (13U)
#define RCC_CR_SHSION_Pos                   (14U)
#define RCC_CR_SHSIRDY_Pos                  (15U)

#define RCC_CR_HSEON_Pos                    (16U)
#define RCC_CR_HSERDY_Pos                   (17U)
#define RCC_CR_HSEBYP_Pos                   (18U)
#define RCC_CR_CSSON_Pos                    (19U)
#define RCC_CR_HSEEXT_Pos                   (20U)
#define RCC_CR_PLL1ON_Pos                   (24U)
#define RCC_CR_PLL1RDY_Pos                  (25U)
#define RCC_CR_PLL2ON_Pos                   (26U)
#define RCC_CR_PLL2RDY_Pos                  (27U)
#define RCC_CR_PLL3ON_Pos                   (28U)
#define RCC_CR_PLL3RDY_Pos                  (29U)
#endif
#define RCC_CR_RESET_VALUE      0x00000035
#define RCC_CR_OFFSET           0x00
//#define RCC_CR_PLLSAI2RDY_BIT   29    // SAI2 PLL clock ready flag
//#define RCC_CR_PLLSAI2ON_BIT    28   // SAI2 PLL enable
//#define RCC_CR_PLLSAI1RDY_BIT   27   // SAI1 PLL clock ready flag
//#define RCC_CR_PLLSAI1ON_BIT    26   // SAI1 PLL enable

#define RCC_CR_PLL3RDY_BIT                  (29U)
#define RCC_CR_PLL3ON_BIT                   (28U)
#define RCC_CR_PLL2RDY_BIT                  (27U)
#define RCC_CR_PLL2ON_BIT                   (26U)
#define RCC_CR_PLL1RDY_BIT       25   // Main PLL (PLL) clock ready flag 
#define RCC_CR_PLL1ON_BIT        24   // Main PLL (PLL) enable
#define RCC_CR_CSSON_BIT        19   // Clock security system enable
#define RCC_CR_HSEBYP_BIT       18   // HSE clock bypass
#define RCC_CR_HSERDY_BIT       17   // HSE clock ready flag
#define RCC_CR_HSEON_BIT        16   // HSE clock enable
#define RCC_CR_HSI48RDY_BIT     13
//#define RCC_CR_HSIASFS_BIT      11   // HSI automatic start from Stop
#define RCC_CR_HSIRDY_BIT         10   // HSI clock ready flag
#define RCC_CR_HSION_BIT           8    // HSI clock enable
#define RCC_CR_MSIRDY_BIT          2    // MSI clock ready flag
#define RCC_CR_MSION_BIT           0    // MSI clock enable

#define RCC_CR_HSICAL_START     8
#define RCC_CR_HSICAL_MASK      0x00ff0000
#define RCC_CR_HSITRIM_START    3
#define RCC_CR_HSITRIM_MASK     0x000000f8

#define RCC_ICSCR_OFFSET         0x04

#define RCC_CFGR1_RESET_VALUE     0x00000000
#define RCC_CFGR1_OFFSET          0x1C


#define RCC_CFGR2_OFFSET          0x20
#define RCC_CFGR3_OFFSET          0x24

#define RCC_PLL1CFGR_POS          0x28
#define RCC_CIER_OFFSET           0x50

#define RCC_CR_HSI48RDY_Pos                 (13U)
#define RCC_CR_HSI48RDY_Msk                 (0x1UL << RCC_CR_HSI48RDY_Pos)          /*!< 0x000002000 */
#define RCC_CR_HSI48RDY                     RCC_CR_HSI48RDY_Msk                     /*!< Internal High Speed Oscillator (HSI48) Clock Ready Flag */


#define RCC_CFGR_PPRE2_START     11
#define RCC_CFGR_PPRE2_MASK      0x0000E000
#define RCC_CFGR_PPRE1_START     8
#define RCC_CFGR_PPRE1_MASK      0x00001E00
#define RCC_CFGR_HPRE_START      4
#define RCC_CFGR_HPRE_MASK       0x000000F0
#define RCC_CFGR_SWS_START       2
#define RCC_CFGR_SWS_MASK        0x0000000C
#define RCC_CFGR_SW_START        0
#define RCC_CFGR_SW_MASK         0x00000003

#define RCC_PLLCFGR_RESET_VALUE  0x00001000
#define RCC_PLLCFGR_OFFSET       0x0C
#define RCC_PLLCFGR_PLLQ_MASK    0x00300000
#define RCC_PLLCFGR_PLLQ_START   21
#define RCC_PLLCFGR_PLLSRC_BIT   0
#define RCC_PLLCFGR_PLLP_MASK    0x00030000
#define RCC_PLLCFGR_PLLP_START   17
//          <bitOffset>8</bitOffset>
//              <bitWidth>7</bitWidth>
#define RCC_PLLCFGR_PLLN_START  8
#define RCC_PLLCFGR_PLLN_MASK   0x0000003F



