Ebiroll/qemu-stm32/hw/arm/stm32/stm32u535_rcc.c
#define RCC_PLLCFGR_PLLM_START   4

#define RCC_PLLSAI1CFGR_RESET_VALUE  0x00001000
#define RCC_PLLSAI1CFGR_OFFSET       0x10


#define RCC_CIR_RESET_VALUE      0x00000000
#define RCC_CIR_OFFSET           0x20
#define RCC_CIR_CSSC_BIT         23
#define RCC_CIR_PLLI2SRDYC_BIT   21
#define RCC_CIR_PLLRDYC_BIT      20
#define RCC_CIR_HSERDYC_BIT      19
#define RCC_CIR_HSIRDYC_BIT      18
#define RCC_CIR_LSERDYC_BIT      17
#define RCC_CIR_LSIRDYC_BIT      16
#define RCC_CIR_PLLI2SRDYIE_BIT  13
#define RCC_CIR_PLLRDYIE_BIT     12
#define RCC_CIR_HSERDYIE_BIT     11
#define RCC_CIR_HSIRDYIE_BIT     10
#define RCC_CIR_LSERDYIE_BIT     9
#define RCC_CIR_LSIRDYIE_BIT     8
#define RCC_CIR_CSSF_BIT         7
#define RCC_CIR_PLLI2SRDYF_BIT  5
#define RCC_CIR_PLLRDYF_BIT     4
#define RCC_CIR_HSERDYF_BIT     3
#define RCC_CIR_HSIRDYF_BIT     2
#define RCC_CIR_LSERDYF_BIT     1
#define RCC_CIR_LSIRDYF_BIT     0



#define RCC_CRRCR_RESET_VALUE   0x00000003
#define RCC_CRRCR_OFFSET        0x14

//RCC_CFGR1
#define RCC_CFGR1_RESET_VALUE   0x00000000
#define RCC_CFGR1_OFFSET        0x1C

// RCC_CFGR3
#define RCC_CFGR3_RESET_VALUE   0x00000000
#define RCC_CFGR3_OFFSET        0x24

#define RCC_PLL1CFGR_RESET_VALUE  0x00000000
#define RCC_PLL1CFGR_OFFSET       0x28

#define RCC_PLL2CFGR_RESET_VALUE  0x00000000
#define RCC_PLL2CFGR_OFFSET       0x2C

// RCC_PLL3CFGR
#define RCC_PLL3CFGR_RESET_VALUE  0x00000000
#define RCC_PLL3CFGR_OFFSET       0x30

#define RCC_PLL1DIVR_RESET_VALUE  0x01010280
#define RCC_PLL1DIVR_OFFSET       0x34

#define RCC_PLL1FRACR_RESET_VALUE 0x00000000
#define RCC_PLL1FRACR_OFFSET      0x38

#define RCC_PLL2DIVR_RESET_VALUE  0x01010280
#define RCC_PLL2DIVR_OFFSET       0x3C

#define RCC_PLL2FRACR_RESET_VALUE 0x00000000
#define RCC_PLL2FRACR_OFFSET      0x40

#define RCC_PLL3DIVR_RESET_VALUE  0x01010280
#define RCC_PLL3DIVR_OFFSET       0x44

#define RCC_PLL3FRACR_RESET_VALUE 0x00000000
#define RCC_PLL3FRACR_OFFSET      0x48

#define RCC_CIER_RESET_VALUE      0x00000000
#define RCC_CIER_OFFSET           0x50

#define RCC_CIFR_RESET_VALUE      0x00000000
#define RCC_CIFR_OFFSET           0x54

#define RCC_CICR_RESET_VALUE      0x00000000
#define RCC_CICR_OFFSET           0x58

#define RCC_AHB1RSTR_RESET_VALUE  0x00000000
#define RCC_AHB1RSTR_OFFSET       0x60

#define RCC_AHB2RSTR1_RESET_VALUE 0x00000000
#define RCC_AHB2RSTR1_OFFSET      0x64

#define RCC_AHB2RSTR2_RESET_VALUE 0x00000000
#define RCC_AHB2RSTR2_OFFSET      0x68

#define RCC_AHB3RSTR_RESET_VALUE  0x00000000
#define RCC_AHB3RSTR_OFFSET       0x6C

#define RCC_APB1RSTR1_RESET_VALUE 0x00000000
#define RCC_APB1RSTR1_OFFSET      0x74

#define RCC_APB1RSTR2_RESET_VALUE 0x00000000
#define RCC_APB1RSTR2_OFFSET      0x78

#define RCC_APB2RSTR_RESET_VALUE  0x00000000
#define RCC_APB2RSTR_OFFSET       0x7C

#define RCC_APB3RSTR_RESET_VALUE  0x00000000
#define RCC_APB3RSTR_OFFSET       0x80

#define RCC_AHB1ENR_RESET_VALUE   0x00100000
#define RCC_AHB1ENR_OFFSET        0x88

#define RCC_AHB2ENR1_RESET_VALUE  0x40000000
#define RCC_AHB2ENR1_OFFSET       0x8C

#define RCC_AHB2ENR2_RESET_VALUE  0x00000000
#define RCC_AHB2ENR2_OFFSET       0x90

#define RCC_AHB3ENR_RESET_VALUE   0x00000000
#define RCC_AHB3ENR_OFFSET        0x94

#define RCC_APB1ENR1_RESET_VALUE  0x00000000
#define RCC_APB1ENR1_OFFSET       0x9C

#define RCC_APB1ENR2_RESET_VALUE  0x00000000
#define RCC_APB1ENR2_OFFSET       0xA0

#define RCC_APB2ENR_RESET_VALUE   0x00000000
#define RCC_APB2ENR_OFFSET        0xA4

#define RCC_APB3ENR_RESET_VALUE   0x00000000
#define RCC_APB3ENR_OFFSET        0xA8

#define RCC_AHB1SMENR_RESET_VALUE  0xFFFFFFFF
#define RCC_AHB1SMENR_OFFSET       0xB0

#define RCC_AHB2SMENR1_RESET_VALUE 0xFFFFFFFF
#define RCC_AHB2SMENR1_OFFSET      0xB4

#define RCC_AHB2SMENR2_RESET_VALUE 0xFFFFFFFF
#define RCC_AHB2SMENR2_OFFSET      0xB8

#define RCC_AHB3SMENR_RESET_VALUE  0xFFFFFFFF
#define RCC_AHB3SMENR_OFFSET       0xBC

#define RCC_APB1SMENR1_RESET_VALUE 0xFFFFFFFF
#define RCC_APB1SMENR1_OFFSET      0xC4

#define RCC_APB1SMENR2_RESET_VALUE 0xFFFFFFFF
#define RCC_APB1SMENR2_OFFSET      0xC8

#define RCC_APB2SMENR_RESET_VALUE  0xFFFFFFFF
#define RCC_APB2SMENR_OFFSET       0xCC

#define RCC_APB3SMENR_RESET_VALUE  0xFFFFFFFF
#define RCC_APB3SMENR_OFFSET       0xD0

#define RCC_SRDAMR_RESET_VALUE     0x00000000
#define RCC_SRDAMR_OFFSET          0xD8

#define RCC_CCIPR1_RESET_VALUE     0x00000000
#define RCC_CCIPR1_OFFSET          0xE0

#define RCC_CCIPR2_RESET_VALUE     0x00000000
#define RCC_CCIPR2_OFFSET          0xE4

#define RCC_CCIPR3_RESET_VALUE     0x00000000
#define RCC_CCIPR3_OFFSET          0xE8

#define RCC_BDCR_RESET_VALUE       0x00000000
#define RCC_BDCR_OFFSET            0xF0

#define RCC_CSR_RESET_VALUE        0x0C000000
#define RCC_CSR_OFFSET             0xF4

#define RCC_SECCFGR_RESET_VALUE    0x00000000
#define RCC_SECCFGR_OFFSET         0x110

#define RCC_PRIVCFGR_RESET_VALUE   0x00000000
#define RCC_PRIVCFGR_OFFSET        0x114

#define RCC_BDCR_LSEON_BIT        0
#define RCC_BDCR_LSERDY_BIT       1
#define RCC_BDCR_LSEBPY_BIT       2
#define RCC_BDCR_LSEDRV_START     3
#define RCC_BDCR_LSEDRV_MASK      0x00000018

#define RCC_CSR_LSECSON_BIT       5
#define RCC_CSR_LSECSSD_BIT       6
#define RCC_CSR_LSESYSON_BIT      7

#define RCC_BDCR_LSESYSRDY        11

#define RCC_CSR_LSION_BIT         26
#define RCC_CSR_LSIRDY_BIT        27





#define SW_HSI_SELECTED 0
#define SW_HSE_SELECTED 1
#define SW_PLL_SELECTED 2

#define GET_BIT_MASK(position, value) ((value ? 1 : 0) << position)
#define GET_BIT_MASK_ONE(position) (1 << position)
#define GET_BIT_MASK_ZERO(position) (~(1 << position))
#define GET_BIT_VALUE(value, position) \
                ((value & GET_BIT_MASK_ONE(position)) >> position)
#define IS_BIT_SET(value, position) ((value & GET_BIT_MASK_ONE(position)) != 0)
#define IS_BIT_RESET(value, position) ((value & GET_BIT_MASK_ONE(position)) ==0)
#define RESET_BIT(var, position) var &= GET_BIT_MASK_ZERO(position)

/* Can be true, false, 0, or 1 */
#define CHANGE_BIT(var, position, new_value) \
            var = new_value ? \
                    (var | GET_BIT_MASK_ONE(position)) : \
                    (var & GET_BIT_MASK_ZERO(position))
#define CHANGE_BITS(var, start, mask, new_value) \
            var = (var & ~mask) | ((new_value << start) & mask)

# define STM32_BAD_REG(offset, size)       \
        hw_error("%s: Bad register 0x%x - size %u\n", __FUNCTION__, (int)offset, size)
# define STM32_WARN_RO_REG(offset)        \
        qemu_log_mask(LOG_GUEST_ERROR, "%s: Read-only register 0x%x\n", \
                      __FUNCTION__, (int)offset)
# define STM32_WARN_WO_REG(offset)        \
        qemu_log_mask(LOG_GUEST_ERROR, "%s: Write-only register 0x%x\n", \
                      __FUNCTION__, (int)offset)
# define STM32_NOT_IMPL_REG(offset, size)      \
        hw_error("%s: Not implemented yet 0x%x - size %u\n", __FUNCTION__, (int)offset, size)
void stm32_hw_warn(const char *fmt, ...)
    __attribute__ ((__format__ (__printf__, 1, 2)));

#define stm32_unimp(x...) qemu_log_mask(LOG_UNIMP, x)


