Ebiroll/qemu-stm32/hw/arm/stm32/stm32u535_rcc.c
// #define stm32f1xx_rcc STM32u535RccState
#if 0
struct stm32f1xx_rcc {
    /* Inherited */
    union {
        struct STM32FXXXRccState inherited;
        struct {
            /* Inherited */
            SysBusDevice busdev;

            /* Properties */
            uint32_t osc_freq;
            uint32_t osc32_freq;

            /* Private */
            MemoryRegion iomem;
            qemu_irq irq;
        };
    };
    
    /* Peripheral clocks */
    Clk PERIPHCLK[STM32_PERIPH_COUNT]; // MUST be first field after `inherited`, because Stm32Rcc's last field aliases this array

};
#endif

/* HELPER FUNCTIONS */
struct Clk {                                                                    
    const char *name;                                                           
                                                                                
    bool enabled;                                                               
                                                                                
    uint32_t input_freq, output_freq, max_output_freq;                          
                                                                                
    uint16_t multiplier, divisor;                                               
                                                                                
    unsigned user_count;                                                        
    qemu_irq user[CLKTREE_MAX_IRQ]; /* Who to notify on change */               
                                                                                
    unsigned output_count;                                                      
    struct Clk *output[CLKTREE_MAX_OUTPUT];                                     
                                                                                
    unsigned input_count;                                                       
    int selected_input;                                                         
    struct Clk *input[CLKTREE_MAX_INPUT];                                       
};                                                                              
                                                                                

/* Enable the peripheral clock if the specified bit is set in the value. */
/*
static void stm32_rcc_periph_enable(
                                    struct STM32u535RccState *s,
                                    uint32_t new_value,
                                    bool init,
                                    int periph,
                                    uint32_t bit_mask)
{
    printf("rcc set 0x%x %s %d %x: %sable\n", new_value, s->PERIPHCLK[periph]->name, periph, bit_mask, (new_value & (1 << bit_mask))?"en":"dis");
    clktree_set_enabled(s->PERIPHCLK[periph], (new_value & (1 << bit_mask)) != 0);
}

*/



/* REGISTER IMPLEMENTATION */

/* Read the configuration register.
   NOTE: Not implemented: CSS, PLLI2S, clock calibration and trimming. */
static uint32_t stm32_rcc_RCC_CR_read(struct STM32u535RccState *s)
{
    /* Get the status of the clocks. */
    const bool PLL1ON = clktree_is_enabled(s->PLL1CLK); 
    const bool PLL2ON = clktree_is_enabled(s->PLL2CLK); 
    const bool PLL3ON = clktree_is_enabled(s->PLL3CLK); 

    const bool HSEON = true; //clktree_is_enabled(s->HSECLK);
    const bool HSION = true; //clktree_is_enabled(s->HSICLK);
    const bool PLLRDY = true;
     const bool HSI48RDY = true;

    /*
    RCC_CR_HSI48RDY
    */

uint32_t new_value =  GET_BIT_MASK(RCC_CR_PLL1RDY_BIT, PLL1ON) |
        GET_BIT_MASK(RCC_CR_PLL1ON_BIT, PLL1ON) |
        GET_BIT_MASK(RCC_CR_PLL2ON_BIT, PLL2ON) |
        GET_BIT_MASK(RCC_CR_PLL3ON_BIT, PLL3ON) |

        GET_BIT_MASK(RCC_CR_HSERDY_BIT, HSEON) |
        GET_BIT_MASK(RCC_CR_HSEON_BIT, HSEON) |

        GET_BIT_MASK(RCC_CR_HSIRDY_BIT, HSION) |
        GET_BIT_MASK(RCC_CR_HSION_BIT, HSION) |

        GET_BIT_MASK(RCC_CR_PLL1RDY_BIT,PLLRDY) |
        GET_BIT_MASK(RCC_CR_HSI48RDY_BIT,HSI48RDY);



    DPRINTF("RCC_CR_read %lu \n",
                (unsigned long)new_value);
    /* build the register value based on the clock states.  If a clock is on,
     * then its ready bit is always set.
     */
    return (
        GET_BIT_MASK(RCC_CR_PLL1RDY_BIT, PLL1ON) |
        GET_BIT_MASK(RCC_CR_PLL1ON_BIT, PLL1ON) |

        GET_BIT_MASK(RCC_CR_HSERDY_BIT, HSEON) |
        GET_BIT_MASK(RCC_CR_HSEON_BIT, HSEON) |

        GET_BIT_MASK(RCC_CR_HSIRDY_BIT, HSION) |
        GET_BIT_MASK(RCC_CR_HSION_BIT, HSION)  |
        GET_BIT_MASK(RCC_CR_HSI48RDY_BIT,HSI48RDY)
    );
}

/* Write the Configuration Register.
 * This updates the states of the corresponding clocks.  The bit values are not
 * saved - when the register is read, its value will be built using the clock
 * states.
 */
static void stm32_rcc_RCC_CR_write(struct STM32u535RccState *s, uint32_t new_value, bool init)
{
    bool new_MSION , new_PLL1ON, new_PLL2ON, new_PLL3ON , new_HSEON, new_HSION, new_PLLISON, new_CSSON;
    DPRINTF("RCC_CR_write %lu \n",
            (unsigned long)new_value);
    // RCC_CR_HSEON | RCC_CR_CSSON | RCC_CR_PLL1ON | RCC_CR_PLL2ON | RCC_CR_PLL3ON)

    new_MSION = IS_BIT_SET(new_value, RCC_CR_MSION_BIT);
    clktree_set_enabled(s->MSICLK, new_MSION);


    new_PLL1ON = IS_BIT_SET(new_value, RCC_CR_PLL1ON_BIT);
    if((clktree_is_enabled(s->PLL1CLK) && !new_PLL1ON) &&
       s->RCC_CFGR_SW == SW_PLL_SELECTED) {
        printf("PLL cannot be disabled while it is selected as the system clock.");
    }
    clktree_set_enabled(s->PLL1CLK, new_PLL1ON);


    new_PLL2ON = IS_BIT_SET(new_value, RCC_CR_PLL2ON_BIT);
    if((clktree_is_enabled(s->PLL2CLK) && !new_PLL2ON) &&
       s->RCC_CFGR_SW == SW_PLL_SELECTED) {
        printf("PLL cannot be disabled while it is selected as the system clock.");
    }
    clktree_set_enabled(s->PLL2CLK, new_PLL2ON);

    new_PLL3ON = IS_BIT_SET(new_value, RCC_CR_PLL3ON_BIT);
    if((clktree_is_enabled(s->PLL3CLK) && !new_PLL3ON) &&
       s->RCC_CFGR_SW == SW_PLL_SELECTED) {
        printf("PLL cannot be disabled while it is selected as the system clock.");
    }
    clktree_set_enabled(s->PLL3CLK, new_PLL3ON);


    DPRINTF("RCC_CR_was %lu \n",
                (unsigned long)new_PLL1ON);

    clktree_set_enabled(s->PLL1CLK, new_PLL1ON);

    DPRINTF("PLL On %lu \n",
            (unsigned long)new_PLL1ON);


    new_HSEON = IS_BIT_SET(new_value, RCC_CR_HSEON_BIT);
    if((clktree_is_enabled(s->HSECLK) && !new_HSEON) &&
       (s->RCC_CFGR_SW == SW_HSE_SELECTED || s->RCC_CFGR_SW == SW_PLL_SELECTED)
       ) {
        printf("HSE oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(s->HSECLK, new_HSEON);

