Ebiroll/qemu-stm32/hw/arm/stm32/stm32u535_rcc.c
    new_HSION = IS_BIT_SET(new_value, RCC_CR_HSION_BIT);
    if((clktree_is_enabled(s->HSECLK) && !new_HSEON) &&
       (s->RCC_CFGR_SW == SW_HSI_SELECTED || s->RCC_CFGR_SW == SW_PLL_SELECTED)
       ) {
        printf("HSI oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(s->HSICLK, new_HSION);

    new_CSSON = IS_BIT_SET(new_value, RCC_CR_CSSON_BIT);
    clktree_set_enabled(s->CSCLK, new_CSSON);


    new_PLLISON = IS_BIT_SET(new_value, RCC_CR_PLL1ON_BIT);
    clktree_set_enabled(s->PLLI2SCLK, new_PLLISON);

    //WARN_UNIMPLEMENTED(new_value, 1 << RCC_CR_CSSON_BIT, RCC_CR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CR_HSICAL_MASK, RCC_CR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CR_HSITRIM_MASK, RCC_CR_RESET_VALUE);
}


static uint32_t stm32_rcc_RCC_PLLCFGR_read(struct STM32u535RccState *s)
{
    return s->RCC_PLLCFGR;
}

static void stm32_rcc_RCC_PLLCFGR_write(struct STM32u535RccState *s, uint32_t new_value, bool init)
{
    /* PLLM division factor */
    //const uint8_t new_PLLM = (new_value & RCC_PLLCFGR_PLLM_MASK) >> RCC_PLLCFGR_PLLM_START;
    //if (new_PLLM <= 1) {
    //    hw_error("PLLM division factor cannot be 0 or 1. Given: %u", new_PLLM);
    //}

    /* PLLN multiplication factor */
    const uint16_t new_PLLN = (new_value & RCC_PLLCFGR_PLLN_MASK) >> RCC_PLLCFGR_PLLN_START;
    //if (new_PLLN <= 1 || new_PLLN >= 433) {
    //    hw_error("PLLN multiplication factor must be between 2 and 432 (inclusive). Given: %u", new_PLLN);
    //}

    /* PLLSRC */
    const uint8_t new_PLLSRC = IS_BIT_SET(new_value, RCC_PLLCFGR_PLLSRC_BIT);

    /* PPLP division factor */
    const uint8_t new_PLLP = 2 + (2 * ((new_value & RCC_PLLCFGR_PLLP_MASK) >> RCC_PLLCFGR_PLLP_START));

    /* Warn in case of illegal writes: 
    if (init == false) {
        const bool are_disabled = (!clktree_is_enabled(s->PLL1CLK) // && TODO: !clktree_is_enabled(s->PLLI2SCLK) );
        if (are_disabled == false) {
            const char *warning_fmt = "Can only change %s while PLL and PLLI2S are disabled\n";
            if (new_PLLM != s->RCC_PLLCFGR_PLLM) {
                printf(warning_fmt, "PLLM");
            }
            if (new_PLLN != s->RCC_PLLCFGR_PLLN) {
                printf(warning_fmt, "PLLN");
            }
            if (new_PLLSRC != s->RCC_PLLCFGR_PLLSRC) {
                printf(warning_fmt, "PLLSRC");
            }
        }
    }
*/
    /* Save new register value */
    s->RCC_PLLCFGR = new_value;

    /* Set the new values: */
    //s->RCC_PLLCFGR_PLLM = new_PLLM;
    s->RCC_PLLCFGR_PLLN = new_PLLN;
    //clktree_set_scale(s->PLLM, new_PLLN, new_PLLM);

    s->RCC_PLLCFGR_PLLSRC = new_PLLSRC;
    //clktree_set_selected_input(s->PLLM, new_PLLSRC);

    s->RCC_PLLCFGR_PLLP = new_PLLP;
    clktree_set_scale(s->PLL1CLK, 1, new_PLLP);

    //WARN_UNIMPLEMENTED(new_value, RCC_PLLCFGR_PLLQ_MASK, RCC_PLLCFGR_RESET_VALUE);
}

#if 0

static uint32_t stm32_rcc_RCC_PLLI2SCFGR_read(struct STM32u535RccState *s)
{
    return s->RCC_PLLI2SCFGR;
}

static void stm32_rcc_RCC_PLLI2SCFGR_write(struct STM32u535RccState *s, uint32_t new_value, bool init)
{
    /* PLLR division factor */
    //const uint16_t new_PLLR = (new_value & RCC_PLLI2SCFGR_PLLR_MASK) >> RCC_PLLI2SCFGR_PLLR_START;
    //if (new_PLLR < 2 || new_PLLR > 7) {
    //    hw_error("PLLR multiplication factor must be between 2 and 7. Given: %u", new_PLLR);
    //}

    /* PLLQ division factor */
    //const uint16_t new_PLLQ = (new_value & RCC_PLLI2SCFGR_PLLQ_MASK) >> RCC_PLLI2SCFGR_PLLQ_START;
    //if (new_PLLQ > 15) {
    //    hw_error("PLLQ multiplication factor must be between 0 and 15 "
    //             "(inclusive). Given: %u", new_PLLQ);
    //}

    /* PLLN multiplication factor */
    //const uint16_t new_PLLN = (new_value & RCC_PLLI2SCFGR_PLLN_MASK) >> RCC_PLLI2SCFGR_PLLN_START;
    //if (new_PLLN < 2 || new_PLLN > 433) {
    //    hw_error("PLLN multiplication factor must be between 2 and 432 (inclusive). Given: %u", new_PLLN);
    //}


    /* Warn in case of illegal writes: */
    if (init == false) {
        const bool are_disabled = (!clktree_is_enabled(s->PLLI2SCLK) /* && TODO: !clktree_is_enabled(s->PLLI2SCLK) */);
        if (are_disabled == false) {
            const char *warning_fmt = "Can only change %s while PLL and PLLI2S are disabled";
            //if (new_PLLR != s->RCC_PLLI2SCFGR_PLLR) {
            //    printf(warning_fmt, "PLLR");
            //}
            //if (new_PLLQ != s->RCC_PLLI2SCFGR_PLLQ) {
            //    printf(warning_fmt, "PLLQ");
            //}
            //if (new_PLLN != s->RCC_PLLCFGR_PLLN) {
            //    printf(warning_fmt, "PLLN");
            //}
        }
    }

    /* Save new register value */
    s->RCC_PLLI2SCFGR = new_value;

    /* Set the new values: */
    s->RCC_PLLI2SCFGR_PLLR = new_PLLR;
    s->RCC_PLLI2SCFGR_PLLQ = new_PLLQ;
    s->RCC_PLLI2SCFGR_PLLN = new_PLLN;
    clktree_set_scale(s->PLLI2SM, new_PLLN, s->RCC_PLLCFGR_PLLM );

    clktree_set_scale(s->PLLI2SCLK, 1, new_PLLR);
    //WARN_UNIMPLEMENTED(new_value, RCC_PLLI2SCFGR_PLLQ_MASK, RCC_PLLI2SCFGR_RESET_VALUE);
}
#endif

static uint32_t stm32_rcc_RCC_CFGR_read(struct STM32u535RccState *s)
{
    return
    (s->RCC_CFGR_PPRE2 << RCC_CFGR_PPRE2_START) |
    (s->RCC_CFGR_PPRE1 << RCC_CFGR_PPRE1_START) |
    (s->RCC_CFGR_HPRE << RCC_CFGR_HPRE_START) |
    (s->RCC_CFGR_SW << RCC_CFGR_SW_START) |
    (s->RCC_CFGR_SW << RCC_CFGR_SWS_START);
}

static void stm32_rcc_RCC_CFGR_write(struct STM32u535RccState *s, uint32_t new_value, bool init)
{
    /* PPRE2 */
    s->RCC_CFGR_PPRE2 = (new_value & RCC_CFGR_PPRE2_MASK) >> RCC_CFGR_PPRE2_START;
    if(s->RCC_CFGR_PPRE2 < 0x4) {
        clktree_set_scale(s->PCLK2, 1, 1);
    } else {
        clktree_set_scale(s->PCLK2, 1, 2 * (s->RCC_CFGR_PPRE2 - 3));
    }

    /* PPRE1 */
    s->RCC_CFGR_PPRE1 = (new_value & RCC_CFGR_PPRE1_MASK) >> RCC_CFGR_PPRE1_START;
    if(s->RCC_CFGR_PPRE1 < 4) {
        clktree_set_scale(s->PCLK1, 1, 1);
    } else {
        clktree_set_scale(s->PCLK1, 1, 2 * (s->RCC_CFGR_PPRE1 - 3));
    }

