Ebiroll/qemu-stm32/hw/arm/stm32/stm32u535_rcc.c
    /* 0b00110110111111101100100111111111 */
    s->RCC_APB1ENR = new_value & 0x36fec9ff;
}

static void stm32_rcc_RCC_BDCR_write(struct STM32u535RccState *s, uint32_t new_value,
                                        bool init) {

}


static uint32_t stm32_rcc_RCC_BDCR_read(struct STM32u535RccState *s)
{
    bool lseon = clktree_is_enabled(s->LSECLK);

    return GET_BIT_MASK(RCC_BDCR_LSERDY_BIT, lseon) |
    GET_BIT_MASK(RCC_BDCR_LSEON_BIT, lseon) |
    GET_BIT_MASK(RCC_BDCR_LSESYSRDY, lseon) ; /* XXX force LSE */
    return 0;
}

/* Works the same way as stm32_rcc_RCC_CR_read */
static uint32_t stm32_rcc_RCC_CSR_read(struct STM32u535RccState *s)
{
    bool lseon = clktree_is_enabled(s->LSICLK);

    return GET_BIT_MASK(RCC_CSR_LSIRDY_BIT, lseon) |
    GET_BIT_MASK(RCC_CSR_LSION_BIT, lseon);
}

/* Works the same way as stm32_rcc_RCC_CR_write */
static void stm32_rcc_RCC_CSR_write(struct STM32u535RccState *s, uint32_t new_value, bool init)
{
    clktree_set_enabled(s->LSICLK, IS_BIT_SET(new_value, RCC_CSR_LSION_BIT));
}


static uint64_t stm32_rcc_readw(void *opaque, hwaddr offset)
{
    struct STM32u535RccState *s = (struct STM32u535RccState *)opaque;

    switch (offset) {
        case RCC_CR_OFFSET:
            return stm32_rcc_RCC_CR_read(s);
        case RCC_PLL1CFGR_POS:
            return stm32_rcc_RCC_PLLCFGR_read(s);
        case RCC_CFGR1_OFFSET:
            return stm32_rcc_RCC_CFGR_read(s);
        case RCC_CFGR2_OFFSET:
            return s->RCC_CFGR2;
        case RCC_CFGR3_OFFSET:
            return s->RCC_CFGR3;
        case RCC_CIER_OFFSET:
            return s->RCC_CIER;
        //case RCC_CIFR_OFFSET:
        //    return stm32_rcc_RCC_CIR_read(s);
        case RCC_AHB1ENR_OFFSET:
            return stm32_rcc_RCC_AHB1ENR_read(s);
        case RCC_AHB2ENR2_OFFSET:
            return stm32_rcc_RCC_AHB2ENR_read(s);
        case RCC_AHB3ENR_OFFSET:
            return stm32_rcc_RCC_AHB3ENR_read(s);
        case RCC_APB2ENR_OFFSET:
            return s->RCC_APB2ENR;
        case RCC_BDCR_OFFSET:
            return stm32_rcc_RCC_BDCR_read(s);
        case RCC_CSR_OFFSET:
            return stm32_rcc_RCC_CSR_read(s);
        case RCC_CRRCR_OFFSET:
            return  s->RCC_CRRCR | 0x2;  // Force ready

        //case RCC_PLLI2SCFGR_OFFSET:
        //    return stm32_rcc_RCC_PLLI2SCFGR_read(s);
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
    return 0;
}

 void stm32_u5rcc_writew(void *opaque, hwaddr offset,
                             uint64_t value);

 void stm32_u5rcc_writew(void *opaque, hwaddr offset,
                             uint64_t value)
{
    struct STM32u535RccState *s = (struct STM32u535RccState *)opaque;

    switch(offset) {
        case RCC_CR_OFFSET:
            stm32_rcc_RCC_CR_write(s, value, false);
            break;
        case RCC_PLL1CFGR_POS:
            stm32_rcc_RCC_PLLCFGR_write(s, value, false);
            break;
        case RCC_CFGR1_OFFSET:
            stm32_rcc_RCC_CFGR_write(s, value, false);
            break;
        case RCC_CFGR2_OFFSET:
            s->RCC_CFGR2 = value;
            break;
        case RCC_CFGR3_OFFSET:
            s->RCC_CFGR3 = value;
            break;
        case RCC_CIER_OFFSET:
            s->RCC_CIER = value;
            break;
        //case RCC_CIFR_OFFSET:
        //    stm32_rcc_RCC_CIR_write(s, value, false);
        //    break;
        case RCC_AHB1ENR_OFFSET:
            stm32_rcc_RCC_AHB1ENR_write(s, value, false);
            break;
        case RCC_AHB3ENR_OFFSET:
            stm32_rcc_RCC_AHB3ENR_write(s, value, false);
            break;
        case RCC_AHB2ENR2_OFFSET:
            stm32_rcc_RCC_AHB2ENR_write(s, value, false);
            break;
        case RCC_APB2ENR_OFFSET:
            stm32_rcc_RCC_APB2ENR_write(s, value, false);
            break;
        case RCC_APB1ENR1_OFFSET:
            stm32_rcc_RCC_APB1ENR_write(s, value, false);
            break;
        case RCC_BDCR_OFFSET:
            stm32_rcc_RCC_BDCR_write(s, value, false);
            break;
        case RCC_CSR_OFFSET:
            stm32_rcc_RCC_CSR_write(s, value, false);
            break;
        case RCC_CRRCR_OFFSET:
            s->RCC_CRRCR = value;
            break;
        //case RCC_PLLI2SCFGR_OFFSET:
        //    stm32_rcc_RCC_PLLI2SCFGR_write(s, value, false);
        //    break;
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
}

static uint64_t stm32_rcc_read(void *opaque, hwaddr offset,
                               unsigned size)
{
    switch(size) {
        case 4:
            return stm32_rcc_readw(opaque, offset);
        default:
            stm32_unimp("Unimplemented: RCC read from register at offset %lu", offset);
            return 0;
    }
}

static void stm32_rcc_write(void *opaque, hwaddr offset,
                            uint64_t value, unsigned size)
{
    switch(size) {
        case 4:
            stm32_u5rcc_writew(opaque, offset, value);
            break;
        case 1: {
            hwaddr woffset = offset & ~0x3;
            uint32_t boffset = offset & 0x3;
            uint32_t val = stm32_rcc_readw(opaque, woffset);
            val &= ~(0xff << boffset);
            val |= (value << boffset);
            stm32_u5rcc_writew(opaque, woffset, value);
        } break;
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
}

static const MemoryRegionOps stm32_rcc_ops = {
    .read = stm32_rcc_read,
    .write = stm32_rcc_write,
    .endianness = DEVICE_NATIVE_ENDIAN
};


static void stm32_rcc_reset(DeviceState *dev)
{
    struct STM32u535RccState *s = DO_UPCAST(struct STM32u535RccState, busdev, SYS_BUS_DEVICE(dev));

    stm32_rcc_RCC_CR_write(s, RCC_CR_RESET_VALUE, true);
    stm32_rcc_RCC_PLLCFGR_write(s, RCC_PLLCFGR_RESET_VALUE, true);
    stm32_rcc_RCC_APB2ENR_write(s, RCC_APB2ENR_RESET_VALUE, true);
    stm32_rcc_RCC_APB1ENR_write(s, RCC_APB1ENR1_RESET_VALUE, true);
    stm32_rcc_RCC_BDCR_write(s, RCC_BDCR_RESET_VALUE, true);
    stm32_rcc_RCC_CSR_write(s, RCC_CSR_RESET_VALUE, true);
}

/* IRQ handler to handle updates to the HCLK frequency.
 * This updates the SysTick scales. */
static void stm32_rcc_hclk_upd_irq_handler(void *opaque, int n, int level)
{
    struct STM32u535RccState *s = (struct STM32u535RccState *)opaque;

    uint32_t hclk_freq = 0;

    hclk_freq = clktree_get_output_freq(s->HCLK);

    /* Only update the scales if the frequency is not zero. */
    if (hclk_freq > 0) {
        //ext_ref_freq = hclk_freq / 8;

        /* Update the scales - these are the ratio of QEMU clock ticks
         * (which is an unchanging number independent of the CPU frequency) to
         * system/external clock ticks.
         */
        system_clock_scale = NANOSECONDS_PER_SECOND / hclk_freq;
    }

#ifdef DEBUG_STM32_RCC
    DPRINTF("Cortex SYSTICK frequency set to %lu Hz (scale set to %d).\n",
            (unsigned long)hclk_freq, system_clock_scale);
#endif
}



/* DEVICE INITIALIZATION */

